/* errAuthorizationInvalidSet */
"-60001" = "Os direitos de autorização não são válidos.";

/* errAuthorizationInvalidRef */
"-60002" = "A referência de autorização não é válida.";

/* errAuthorizationInvalidTag */
"-60003" = "A etiqueta de autorização não é válida.";

/* errAuthorizationInvalidPointer */
"-60004" = "A autorização devolvida é inválida.";

/* errAuthorizationDenied */
"-60005" = "A autorização foi recusada.";

/* errAuthorizationCanceled */
"-60006" = "A autorização foi cancelada pelo utilizador.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "A autorização foi recusada porque não é possível qualquer tipo de interacção por parte do utilizador.";

/* errAuthorizationInternal */
"-60008" = "Impossível obter autorização para esta operação.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Não é permitido converter a autorização num formato externo.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Não é permitido criar a autorização a partir de um formato externo.";

/* errAuthorizationInvalidFlags */
"-60011" = "O(s) sinalizador(es) de opção fornecido(s) são inválidos para esta operação de autorização.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "O programa especificado não foi executado.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "Foi devolvido um estado inválido durante a execução de uma ferramenta privilegiada.";

/* errAuthorizationBadAddress */
"-60033" = "O endereço do socket solicitado não é válido (tem de ser 0-1023, inclusive).";

/* errSSLProtocol */
"-9800" = "Erro do protocolo SSL";

/* errSSLNegotiation */
"-9801" = "Ocorreu uma falha na negociação Cipher Suite";

/* errSSLFatalAlert */
"-9802" = "Alerta fatal";

/* errSSLWouldBlock */
"-9803" = "ocorreria um bloqueio I/O (não fatal)";

/* errSSLSessionNotFound */
"-9804" = "tentativa de restauro de sessão desconhecida";

/* errSSLClosedGraceful */
"-9805" = "ligação fechada";

/* errSSLClosedAbort */
"-9806" = "ligação fechada porque ocorreu um erro";

/* errSSLXCertChainInvalid */
"-9807" = "cadeia de certificados inválida";

/* errSSLBadCert */
"-9808" = "formato de certificado inválido";

/* errSSLCrypto */
"-9809" = "erro criptográfico";

/* errSSLInternal */
"-9810" = "Erro interno";

/* errSSLModuleAttach */
"-9811" = "falha na ligação do módulo";

/* errSSLUnknownRootCert */
"-9812" = "cadeira de certificados válida, segurança insuficiente na root";

/* errSSLNoRootCert */
"-9813" = "cadeia de certificados não verificada pela root";

/* errSSLCertExpired */
"-9814" = "a cadeia inclui um certificado expirado";

/* errSSLCertNotYetValid */
"-9815" = "a cadeia inclui um certificado que ainda não é válido";

/* errSSLClosedNoNotify */
"-9816" = "o servidor terminou a sessão sem aviso";

/* errSSLBufferOverflow */
"-9817" = "buffer insuficiente";

/* errSSLBadCipherSuite */
"-9818" = "SSLCipherSuite inválido";

/* errSSLPeerUnexpectedMsg */
"-9819" = "mensagem inesperada recebida";

/* errSSLPeerBadRecordMac */
"-9820" = "MAC inválido";

/* errSSLPeerDecryptionFail */
"-9821" = "falha ao decifrar";

/* errSSLPeerRecordOverflow */
"-9822" = "excesso de informação no registo";

/* errSSLPeerDecompressFail */
"-9823" = "falha na descompressão";

/* errSSLPeerHandshakeFail */
"-9824" = "falha no handshake";

/* errSSLPeerBadCert */
"-9825" = "certificado inválido";

/* errSSLPeerUnsupportedCert */
"-9826" = "formato de certificado inválido";

/* errSSLPeerCertRevoked */
"-9827" = "certificado revogado";

/* errSSLPeerCertExpired */
"-9828" = "o certificado caducou";

/* errSSLPeerCertUnknown */
"-9829" = "certificado desconhecido";

/* errSSLIllegalParam */
"-9830" = "parâmetro inválido";

/* errSSLPeerUnknownCA */
"-9831" = "Autoridade desconhecida";

/* errSSLPeerAccessDenied */
"-9832" = "acesso recusado";

/* errSSLPeerDecodeError */
"-9833" = "erro de descodificação";

/* errSSLPeerDecryptError */
"-9834" = "erro ao decifrar";

/* errSSLPeerExportRestriction */
"-9835" = "restrição de exportação";

/* errSSLPeerProtocolVersion */
"-9836" = "versão de protocolo inválida";

/* errSSLPeerInsufficientSecurity */
"-9837" = "segurança insuficiente";

/* errSSLPeerInternalError */
"-9838" = "erro interno";

/* errSSLPeerUserCancelled */
"-9839" = "cancelado pelo utilizador";

/* errSSLPeerNoRenegotiation */
"-9840" = "renegociação não permitida";

/* errSSLServerAuthCompleted */
"-9841" = "o certificado do servidor é válido, ou foi ignorado se a verificação estiver desactivada";

/* errSSLClientCertRequested */
"-9842" = "o servidor pediu um certificado de cliente";

/* errSSLHostNameMismatch */
"-9843" = "erro no nome do servidor";

/* errSSLConnectionRefused */
"-9844" = "a ligação caiu antes de responder";

/* errSSLDecryptionFail */
"-9845" = "falha ao decifrar";

/* errSSLBadRecordMac */
"-9846" = "MAC inválido";

/* errSSLRecordOverflow */
"-9847" = "excesso de informação no registo";

/* errSSLBadConfiguration */
"-9848" = "erro de configuração";

/* errSecSuccess */
"0" = "Não há erros.";

/* errSecUnimplemented */
"-4" = "Função ou operação por implementar.";

/* errSecParam */
"-50" = "Um ou mais parâmetros passados a uma função não eram válidos.";

/* errSecAllocate */
"-108" = "Ocorreu uma falha na atribuição de memória.";

/* errSecNotAvailable */
"-25291" = "Porta-chaves indisponível. Poderá ser necessário reiniciar o computador.";

/* errSecReadOnly */
"-25292" = "Este porta-chaves não pode ser alterado.";

/* errSecAuthFailed */
"-25293" = "Nome do utilizador ou palavra-passe inválidos.";

/* errSecNoSuchKeychain */
"-25294" = "O porta-chaves especificado não foi localizado.";

/* errSecInvalidKeychain */
"-25295" = "O porta-chaves especificado não é válido.";

/* errSecDuplicateKeychain */
"-25296" = "Já existe um porta-chaves com o mesmo nome.";

/* errSecDuplicateCallback */
"-25297" = "A função especificada está já instalada.";

/* errSecInvalidCallback */
"-25298" = "A função especificada não é válida.";

/* errSecDuplicateItem */
"-25299" = "O item especificado já existe no porta-chaves.";

/* errSecItemNotFound */
"-25300" = "Não foi possível localizar o item especificado no porta-chaves.";

/* errSecBufferTooSmall */
"-25301" = "Não existe memória suficiente para utilizar o item especificado.";

/* errSecDataTooLarge */
"-25302" = "Este item inclui informação demasido extensa ou num formato que não pode ser visualizado.";

/* errSecNoSuchAttr */
"-25303" = "O atributo especificado não existe.";

/* errSecInvalidItemRef */
"-25304" = "O item especificado é inválido. Poderá ter sido eliminado do porta-chaves.";

/* errSecInvalidSearchRef */
"-25305" = "Impossível pesquisar o porta-chaves activo.";

/* errSecNoSuchClass */
"-25306" = "O item especificado não parece ser um item válido do porta-chaves.";

/* errSecNoDefaultKeychain */
"-25307" = "Não foi encontrado um porta-chaves predefinido.";

/* errSecInteractionNotAllowed */
"-25308" = "Interacção do utilizador não permitida.";

/* errSecReadOnlyAttr */
"-25309" = "Impossível alterar o atributo especificado.";

/* errSecWrongSecVersion */
"-25310" = "Este porta-chaves foi criado por uma versão diferente do sistema e não pode ser aberto.";

/* errSecKeySizeNotAllowed */
"-25311" = "Este item especifica um tamanho demasiado grande para a chave.";

/* errSecNoStorageModule */
"-25312" = "Não foi possível carregar um componente necessário (módulo de armazenamento de dados). Poderá ser necessário reiniciar o computador.";

/* errSecNoCertificateModule */
"-25313" = "Não foi possível carregar um componente necessário (módulo de certificado). Poderá ser necessário reiniciar o computador.";

/* errSecNoPolicyModule */
"-25314" = "Não foi possível carregar um componente necessário (módulo de política). Poderá ser necessário reiniciar o computador.";

/* errSecInteractionRequired */
"-25315" = "A interacção do utilizador é necessária, mas não é, de momento, permitida.";

/* errSecDataNotAvailable */
"-25316" = "Impossível obter o conteúdo do item.";

/* errSecDataNotModifiable */
"-25317" = "Impossível alterar o conteúdo do item.";

/* errSecCreateChainFailed */
"-25318" = "Um ou mais certificados necessários à validação deste certificado não foram localizados.";

/* errSecInvalidPrefsDomain */
"-25319" = "O domínio de preferências especficado não é válido.";

/* errSecACLNotSimple */
"-25240" = "A lista de controlo de acesso especificada não é standard.";

/* errSecPolicyNotFound */
"-25241" = "Política especificada inexistente.";

/* errSecInvalidTrustSetting */
"-25242" = "A definição de segurança não é válida.";

/* errSecNoAccessForItem */
"-25243" = "O item especificado não inclui controlo de acesso.";

/* errSecInvalidOwnerEdit */
"-25244" = "A tentativa de alteração do proprietário do elemento não é válida.";

/* errSecTrustNotAvailable */
"-25245" = "Resultados indisponíveis.";

/* errSecUnsupportedFormat */
"-25256" = "Formato de importação/exportação não suportado.";

/* errSecUnknownFormat */
"-25257" = "Formato de importação desconhecido.";

/* errSecKeyIsSensitive */
"-25258" = "A chave necessita ser ajustada para exportação.";

/* errSecMultiplePrivKeys */
"-25259" = "Foi efectuada uma tentativa de importação de várias chaves privadas.";

/* errSecPassphraseRequired */
"-25260" = "É necessária uma palavra-passe para importação/exportação.";

/* errSecInvalidPasswordRef */
"-25261" = "A referência da palavra-passe é inválida.";

/* errSecInvalidTrustSettings */
"-25262" = "O registo de definições de segurança está danificado.";

/* errSecNoTrustSettings */
"-25263" = "Não foi encontrada nenhuma definição de segurança.";

/* errSecPkcs12VerifyFailure */
"-25264" = "A verificação de MAC falhou durante a importação de PKCS12.";

/* errSecDecode */
"-26275" = "Não foi possível descodificar os dados fornecidos.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "Vector do CSP para valores de erro dos buffers .";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "Valores de erro de contexto criptográfico do CSP.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "Valores de erro da API criptográficos faseados do CSP.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Foi efectuada uma tentativa de utilização de chave pública que ficou incompleta devido a * falta de parâmetros específicos de algoritmo.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "falhou correspondência da assinatura do código";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "StartDate/EndDate inválida da chave";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Códigos de erro na sincronização de porta-chaves";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "Verificação de preenchimento SSLv2: detectado ataque de anulação";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "O argumento OpenParameters passado para CSSM_DL_DbCreate ou CSSM_DL_DbOpen não era NULO nem um apontador para uma estrutura CSSM_APPLEDL_OPEN_PARAMETERS válida.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "uma operação falhou, porque o disco está cheio";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "uma operação falhou, porque o espaço em disco foi excedido";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "uma operação falhou, porque um ficheiro era demasiado grande";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "existe informação interna na base de dados do porta-chaves (“blob”) que não é válida";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "a versão interna do formato de dados para a informação interna da base de dados (“blob”) não é válida";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Nomes de host divergentes";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Extensão não compreendida com identificador Crítico verdadeiro";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Extensão das restrições básicas exigida pela política, mas não está presente";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "BasicConstraints.CA inválidas";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "ID de chave de autoridade inválida";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "ID de chave de sujeito inválida";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Utilização de chave inválida para a política";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Utilização de chave expandida inválida para a política";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Ligação inválida sujeito/ID de chave de autoridade";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint excedida";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Grupo de certificados terminado num certificado de raiz que não efectuou autoverificação";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL expirou/ainda não é válido";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Não é possível encontrar CRL adequado";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "servidor específico de CRL não operacional";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "URL do ponto de distribuição de CRL ilegível";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Extensão crítica do certificado/CRL desconhecida";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL não verificável numa âncora ou raiz";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL verificado numa raiz não segura";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL falhou verificação da política";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Violação da extensão do IssuingDistributionPoint";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Certificado não encontrado no issuerAltName especificado";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Certificado irregular obtido do issuerAltName especificado";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "Endereço de e-mail de S/MIME divergente";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "ExtendedKeyUsage de S/MIME adequada não localizada";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "Incompatibilidade de KeyUsage de S/MIME";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, certificado com KeyUsage com identificador !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, registo isolado com nome de sujeito vazio e sem endereço de e-mail * em SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, registo isolado com nome de sujeito vazio, SubjectAltName * não crítico";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "ExtendedKeyUsage SSL adequada não localizada";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "resposta de OCSP não analisável";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "pedido de OCSP não analisável";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "Serviço de OCSP indisponível";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "Estado de OCSP: certificado não reconhecido";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "verificação de revogação sem sucesso para cada certificado";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "erro geral de rede";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "Resposta de OCSP não verificável numa âncora ou raiz";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "Resposta de OCSP verificada numa raiz não segura";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "Erro de assinatura da resposta de OCSP";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Assinatura inexistente para resposta de OCSP";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "Estado da resposta de OCSP: pedido incorrecto";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "Estado da resposta de OCSP: erro interno";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "Estado da resposta de OCSP: tente mais tarde";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "Estado da resposta de OCSP: necessária assinatura";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "Estado da resposta de OCSP: não autorizado";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "nonce da resposta de OCSP não correspondeu ao pedido";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Comprimento de cadeia do certificado ilegal para assinatura de código";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Faltam restrições básicas para assinatura de código";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "PathLengthConstraint incorrecto para assinatura de código";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Falta ExtendedKeyUsage para assinatura de código";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Detectado certificado de assinatura de código de desenvolvimento";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Comprimento de cadeia do certificado ilegal para assinatura de recursos";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "utilização expandida irregular da chave para assinatura de recursos";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Definição de segurança: recusar";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "SubjectName vazio inválido";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "ID da declaração de certificado qualificado crítica desconhecida";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "pedido de certificado em fila de espera";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "pedido de certificado redireccionado";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "erro geral reportado pelo servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "erro de parâmetro comunicado pelo servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "erro de autorização comunicado pelo servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "não implementação comunicada pelo servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "indisponibilidade comunicada pelo servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "servidor comunicou que já existe";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "erro de serviço comunicado pelo servidor";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "pedido já pendente para o utilizador especificado";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "nenhum pedido pendente para o utilizador especificado";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR não conseguiu verificar";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "o servidor comunicou falha na verificação de consistência";

/* errSecCSUnimplemented */
"-67072" = "funcionalidade de assinatura de código não implementada";

/* errSecCSInvalidObjectRef */
"-67071" = "referência a objecto da API inválida";

/* errSecCSInvalidFlags */
"-67070" = "foram especificados marcadores API inválidos ou inapropriados";

/* errSecCSObjectRequired */
"-67069" = "um argumento de apontador necessário é NULO";

/* errSecCSStaticCodeNotFound */
"-67068" = "não é possível localizar o objecto de código no disco";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "não é possível localizar convidados através deste conjunto de atributos";

/* errSecCSInvalidAttributeValues */
"-67066" = "os valores de atributo fornecidos são inválidos";

/* errSecCSNoSuchCode */
"-67065" = "não existe nenhum convidado no host com os atributos solicitados";

/* errSecCSMultipleGuests */
"-67064" = "existem múltiplos convidados no host com este valor de atributo";

/* errSecCSGuestInvalid */
"-67063" = "a identidade do código foi invalidada";

/* errSecCSUnsigned */
"-67062" = "o objecto de código não está assinado";

/* errSecCSSignatureFailed */
"-67061" = "código ou assinatura modificada";

/* errSecCSSignatureNotVerifiable */
"-67060" = "não é possível ler a assinatura, por exemplo, devido a um sistema de ficheiros que mapeia a raiz para um utilizador sem privilégios";

/* errSecCSSignatureUnsupported */
"-67059" = "tipo ou versão da assinatura não suportada";

/* errSecCSBadDictionaryFormat */
"-67058" = "um recurso ou um ficheiro plist está incorrecto";

/* errSecCSResourcesNotSealed */
"-67057" = "os recursos não são selados pela assinatura";

/* errSecCSResourcesNotFound */
"-67056" = "não é possível localizar recursos selados no código";

/* errSecCSResourcesInvalid */
"-67055" = "o directório do recurso selado é inválido";

/* errSecCSBadResource */
"-67054" = "recurso selado em falta ou inválido";

/* errSecCSResourceRulesInvalid */
"-67053" = "regra(s) de selecção de recursos inválida(s)";

/* errSecCSReqInvalid */
"-67052" = "requisitos do código inválidos ou danificados";

/* errSecCSReqUnsupported */
"-67051" = "tipo ou versão dos requisitos do código não suportada";

/* errSecCSReqFailed */
"-67050" = "falha no preenchimento dos requisitos do código";

/* errSecCSBadObjectFormat */
"-67049" = "formato do ficheiro objecto inválido ou inadequado";

/* errSecCSInternalError */
"-67048" = "erro interno no subsistema de assinatura de código";

/* errSecCSHostReject */
"-67047" = "código rejeitou o próprio host";

/* errSecCSNotAHost */
"-67046" = "este código não é um host";

/* errSecCSSignatureInvalid */
"-67045" = "formato inválido da assinatura";

/* errSecCSHostProtocolRelativePath */
"-67044" = "violação do protocolo de host - caminho absoluto do convidado necessário";

/* errSecCSHostProtocolContradiction */
"-67043" = "violação do protocolo de host - modos de alojamento contraditórios";

/* errSecCSHostProtocolDedicationError */
"-67042" = "violação do protocolo de host - operação não permitida com/para um convidado dedicado";

/* errSecCSHostProtocolNotProxy */
"-67041" = "violação do protocolo de host - alojamento de proxy não accionado";

/* errSecCSHostProtocolStateError */
"-67040" = "violação do protocolo de host - pedido de alteração do estado do convidado inválido";

/* errSecCSHostProtocolUnrelated */
"-67039" = "violação do protocolo de host - o convidado especificado não é um convidado do host especificado";

/* errSecCSInvalidOperation */
"-67038" = "a operação pedida não é válida";

/* errSecCSNotSupported */
"-67037" = "operação não suportada para este tipo de código";

/* errSecCSCMSTooLarge */
"-67036" = "a assinatura é demasiado longa para incorporar";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "violação do protocolo de host - hash de convidado não é válido";

/* errSecCSStaticCodeChanged */
"-67034" = "o programa no disco não coincide com o que está a ser executado ";

/* errSecCSSigDBDenied */
"-67033" = "Não é permitido aceder à base de dados de assinaturas";

/* errSecCSSigDBAccess */
"-67032" = "não foi possível aceder à base de dados de assinaturas";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "o host devolveu atributos de convidado inválidos ou inconsistentes";

/* errSecMisc_dskFulErr */
"-34" = "O disco está cheio.";

/* errSecMisc_nsvErr */
"-35" = "Não foi possível localizar o disco. É possível que tenha sido ejectado.";

/* errSecMisc_bdNamErr */
"-37" = "Tentativa de abertura de ficheiro cujo nome apresenta um carácter inválido.";

/* errSecMisc_fnfErr */
"-43" = "Não foi possível encontrar o ficheiro.";

/* errSecMisc_wPrErr */
"-44" = "O disco está protegido contra escrita.";

/* errSecMisc_fLckdErr */
"-45" = "O ficheiro está protegido.";

/* errSecMisc_vLckdErr */
"-46" = "O volume está protegido.";

/* errSecMisc_fBsyErr */
"-47" = "Ficheiro em utilização. Poderá ter sido aberto por outra aplicação.";

/* errSecMisc_dupFNErr */
"-48" = "Ficheiro com o mesmo nome já existente.";

/* errSecMisc_opWrErr */
"-49" = "O ficheiro está já aberto com permissão para escrita.";

/* errSecMisc_volOffLinErr */
"-53" = "O volume está indisponível. Poderá ter sido ejectado.";

/* errSecMisc_permErr */
"-54" = "Impossível abrir ficheiro. Poderá ter sido aberto por outra aplicação.";

/* errSecMisc_extFSErr */
"-58" = "O volume não parece ser compatível.";

/* errSecMisc_wrPermErr */
"-61" = "Impossível escrever no ficheiro. Poderá ter sido aberto com privilégios de acesso insuficientes.";

/* errSecMisc_offLinErr */
"-65" = "O periférico de armazenamento está indisponível. Poderá ter sido ejectado.";

/* errSecMisc_dirNFErr */
"-120" = "Directório inexistente.";

/* errSecMisc_volGoneErr */
"-124" = "O volume do servidor está indisponível. Poderá ter sido desligado.";

/* errSecMisc_userCanceledErr */
"-128" = "A operação foi cancelada pelo utilizador.";

/* errSecMisc_resNotFound */
"-192" = "Recurso necessário inexistente.";

/* errSecMisc_resFNotFound */
"-193" = "Recurso necessário inexistente ou danificado.";

/* errSecMisc_icNoURLErr */
"-673" = "O local (URL) especificado é de tipo desconhecido ou não inclui informação suficiente.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Não foi detectada qualquer aplicação para abrir o URL especificado.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "O local (URL) deste item não existe ou foi incorrectamente formatado.";

/* errSecMisc_afpAccessDenied */
"-5000" = "O acesso ao item foi recusado.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "A autenticação falhou. A palavra-passe deste servidor poderá ter sido alterada após o item ter sido adicionado ao porta-chaves.";

